# RbsParallelconduitsVerticalOffsetValue Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsParallelconduitsVerticalOffsetValue Property
ParameterTypeId Class See Also
---
"Vertical Offset value for parallel conduits"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsParallelconduitsVerticalOffsetValue { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsParallelconduitsVerticalOffsetValue As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsParallelconduitsVerticalOffsetValue {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace